Разработка_GZ/src/InformationRegisters/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОрганизаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПолномочий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>EnumRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Разработка_GZ/src/Enums/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтветственныеЛицаОрганизаций</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйБухгалтер</name>
  </enumValues>
  <enumValues>
    <name>РуководительКадровойСлужбы</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаБухгалтерскиеРегистры</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаНалоговыеРегистры</name>
  </enumValues>
  <enumValues>
    <name>УполномоченныйПредставитель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаОформление</name>
  </enumValues>
</mdclass:Enum>

Разработка_GZ/src/CommonModules/ЭлектронныйДокументооборотСКонтролирующимиОрганамиБПКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуСотрудникаНаРеквизите(Сотрудник, ОбработчикЗакрытияФормы = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", Сотрудник);
	
	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаЭлемента", ПараметрыФормы, , , , , ОбработчикЗакрытияФормы);
	
КонецПроцедуры

Процедура ОткрытьФормуРуководителя(Организация, ОбработчикЗакрытияФормы = Неопределено) Экспорт
	
	ОтветственноеЛицо = ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель");
	
	ОткрытьФормуОтветственногоЛица(Организация, ОтветственноеЛицо, ОбработчикЗакрытияФормы);
	
КонецПроцедуры

Процедура ОткрытьФормуГлБухгалтера(Организация, ОбработчикЗакрытияФормы = Неопределено) Экспорт
	
	ОтветственноеЛицо = ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер");
	
	ОткрытьФормуОтветственногоЛица(Организация, ОтветственноеЛицо, ОбработчикЗакрытияФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуОтветственногоЛица(Организация, ОтветственноеЛицо, ОбработчикЗакрытияФормы)
	
	ЗначенияЗаполнения = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо,Должность",
		Организация,
		ОтветственноеЛицо,
		ОбщегоНазначенияБПВызовСервера.ПодобратьВероятнуюДолжностьОтветственногоЛица(ОтветственноеЛицо));
	
	РуководительКлючЗаписи = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ПолучитьКлючЗаписиРегистраОтветственныеЛицаОрганизаций(Организация,ОтветственноеЛицо); 	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",			РуководительКлючЗаписи);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",	ЗначенияЗаполнения);
	
	ОткрытьФорму("РегистрСведений.ОтветственныеЛицаОрганизаций.ФормаЗаписи", ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
